# https://github.com/deoren/config-files

# Export: code --list-extensions

2gua.rainbow-brackets
766b.go-outliner
alefragnani.Bookmarks
alefragnani.pascal
alefragnani.pascal-formatter
bmarkovic.haproxy
bungcip.better-toml
chrislajoie.vscode-modelines
CoenraadS.bracket-pair-colorizer-2
coolbear.systemd-unit-file
darkriszty.markdown-table-prettify
DavidAnson.vscode-markdownlint
donjayamanne.githistory
DotJoshJohnson.xml
dzhavat.css-initial-value
eamodio.gitlens
eliean.vscode-svn
formulahendry.docker-explorer
GitHub.vscode-pull-request-github
GlenBuktenica.unicode-substitutions
Gruntfuggly.todo-tree
haaaad.ansible
humao.rest-client
idleberg.innosetup
ipedrazas.kubernetes-snippets
joaompinto.asciidoctor-vscode
johnpapa.vscode-peacock
johnstoncode.svn-scm
lextudio.restructuredtext
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-mssql.mssql
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-ssh-explorer
ms-vscode-remote.remote-wsl
ms-vscode.Go
ms-vscode.powershell
pranaygp.vscode-css-peek
redhat.vscode-xml
redhat.vscode-yaml
samuelcolvin.jinjahtml
shuworks.vscode-table-formatter
stayfool.vscode-asciidoc
stkb.rewrap
streetsidesoftware.code-spell-checker
vscoss.vscode-ansible
waderyan.gitblame
yzhang.markdown-all-in-one
zenor.makefile-creator
