# https://github.com/deoren/config-files

# Export: code --list-extensions

2gua.rainbow-brackets
alefragnani.Bookmarks
bmarkovic.haproxy
chrislajoie.vscode-modelines
CoenraadS.bracket-pair-colorizer-2
coolbear.systemd-unit-file
DavidAnson.vscode-markdownlint
donjayamanne.githistory
eamodio.gitlens
formulahendry.docker-explorer
GlenBuktenica.unicode-substitutions
Gruntfuggly.todo-tree
ipedrazas.kubernetes-snippets
johnpapa.vscode-peacock
johnstoncode.svn-scm
lextudio.restructuredtext
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-ssh-explorer
ms-vscode-remote.remote-wsl
ms-vscode.Go
ms-vscode.powershell
pranaygp.vscode-css-peek
redhat.vscode-yaml
shuworks.vscode-table-formatter
stkb.rewrap
streetsidesoftware.code-spell-checker
vscoss.vscode-ansible
yzhang.markdown-all-in-one
